#!/usr/bin/env python
#!-*-codinng:utf-8 -*-
#!@Time   :2019/5/7 21:22
#!@Author :star xu
#!@File   :Day_3.py

#题目 一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？


#x+100=m**2
#x+100+168=n**2
#m**2-n**2=168
#(m+n)(m-n)=168
#m+n=i,m-n=j
#m=(i+j)/2,n=(i-j)/2，因为m,n是完全平方数，可得i和j要么两个都是偶数，要么两个都是奇数
#由于i*j=168,168是偶数，可得i和j当中必有偶数
#结合倒数两条，可得i和j是大于等于2的偶数
#由于j>=2,2<=i<=168/2

for i in range(2,85,2):
    if 168%2 == 0:
        j = 168/i
        if i > j and (i + j) % 2 == 0 and (i - j) % 2 == 0:
            n = (i - j) / 2
            print(n * n - 100)